<?php
//参考https://blog.csdn.net/qq_16399991/article/details/56676755
return [
//    'ROLE'=>['']
//    'PROCESS_TYPE' => ['BEGIN'=>1,'COMMERCE_REVIEW'=>2,'BUSINESS_REVIEW'=>3,'LEAD_REVIEW'=>4,'END'=>5],
    'PROCESS_TYPE' => ['BEGIN' => '合同草拟', 'COMMERCE_REVIEW' => '商务部评审会签', 'BUSINESS_REVIEW' => '业务部评审会签', 'LEAD_REVIEW' => '领导审批', 'END' => '合同归档'],
//    1-委托人、2-船公司、3-订舱公司、4-换单公司、5-货代公司、6-车队、7-保险公司、8-仓储公司、9-铁路公司、10-开证公司、
//            11-提箱公司、12-还箱公司、13-检测公司、14-消毒公司、15-蒸熏公司、16-理货公司、17-装卸公司、18-其他
    'LOGISTICS_ROLE' => [1 => '委托人', 2 => '船公司', 3 => '订舱公司', 4 => '换单公司', 5 => '货代公司', 6 => '车队', 7 => '保险公司', 8 => '仓储公司', 9 => '铁路公司', 10 => '开证公司',
        11 => '提箱公司', 12 => '还箱公司', 13 => '检测公司', 14 => '消毒公司', 15 => '蒸熏公司', 16 => '理货公司', 17 => '装卸公司', 18 => '其他'],
    'CURRENCY' => ['CNY' => '人民币', 'USD' => '美元'],
    'RECEIVE_MAX_TIME' => ['15' => '发票日+15天付款', '30' => '发票日+30天付款', '45' => '发票日+45天付款', '60' => '发票日+60天付款'],
    'PAY_MAX_TIME' => ['15' => '发票日+15天收款', '30' => '发票日+30天收款', '45' => '发票日+45天收款', '60' => '发票日+60天收款'],
    //对应role表，key是id，value是name
//    'REVIEW'=>['1'=>'销售','2'=>'商务','6'=>'业务','5'=>'总经理','7'=>'综合部'],
    //<editor-fold desc="合同审批流程">
    //key是role表id，数组的先后也就是合同审批流程的先后
    'REVIEW' => ['1' => '合同草拟', '2' => '商务会签', '6' => '业务会签', '5' => '领导审批', '7' => '合同归档'],
    'REVIEW_ALIAS' => [0 => 1, 1 => 2, 2 => 6, 3 => 5, 4 => 7],
    //</editor-fold>
    'CONTRACT_TYPE' => ['customer' => '客户合同', 'supplier' => '供应商合同'],
    'CONTRACT_FROM' => ['company' => '公司揽货', 'person' => '销售揽货'],
    'FRIGHT_FORWARDER_PROCESS' => [1 => '接单', 2 => '订舱', 3 => '空箱出场', 4 => '重箱出场', 5 => '报关', 6 => '查验', 7 => '放行', 8 => '装船', 9 => '离港', 10 => '签单'],
    'CUSTOMER_SUPPLIER_REVIEW' => [1 => '销售', 2 => '商务'],
];
